-- ユーザ情報の仮登録用
INSERT INTO "user_info"
    (employee_number, authority_id, is_enabled, password)
VALUES
    ('medis', '0', 'true', 'medis'),
    ('gu', '1', 'true', 'gupass');

-- トップページのマスタっぽいやつ
INSERT INTO "box"
    (box_id, box_logic_name, box_name)
VALUES
    ('0', '', '最近の更新'),
    ('1', '', '自分の投稿した文書'),
    ('2', '', '監視タグ文書一覧'),
    ('3', '', 'お気にいり文書一覧'),
    ('4', '', 'テンプレート一覧');

-- トップページの表示情報
INSERT INTO "toppage"
    (box_id, employee_number, toppage_order)
VALUES
    ('0', 'gu', '0'),
    ('1', 'gu', '3'),
    ('2', 'gu', '1'),
    ('3', 'gu', '2'),
    ('4', 'gu', '4');

-- ドキュメントの情報
INSERT INTO "document_info"
    (document_id, employee_number, template_id, document_create_date, is_document_publish)
VALUES
    ('d0000000000', '99999', 't0000000000', '2018/01/01', 'true'),
    ('d0000000001', '99999', 't0000000001', '2018/01/01', 'true'),
    ('d0000000002', '99999', 't0000000002', '2018/01/01', 'true'),
    ('d0000000003', '99999', 't0000000003', '2018/01/01', 'true'),
    ('d0000000004', '99999', 't0000000004', '2018/01/01', 'true'),
    ('d0000000005', '99999', 't0000000005', '2018/01/01', 'false'),
    ('d0000000006', '99999', 't0000000006', '2018/01/01', 'false'),
    ('d0000000007', '99999', 't0000000007', '2018/01/01', 'true'),
    ('d0000000008', '11111', 't0000000008', '2018/01/01', 'true'),
    ('d0000000009', '11111', 't0000000009', '2018/01/01', 'true'),
    ('d0000000010', '11111', 't0000000010', '2018/01/01', 'true'),
    ('d0000000011', '11111', 't0000000011', '2018/01/01', 'true'),
    ('d0000000012', '11111', 't0000000012', '2018/01/01', 'true'),
    ('d0000000013', '11111', 't0000000013', '2018/01/01', 'false'),
    ('d0000000014', '11111', 't0000000014', '2018/01/01', 'false'),
    ('d0000000015', 'aaaaa', 't0000000015', '2018/01/01', 'true');

